Revit 2024 API
Water.WaterColorByObject Property
 The property labeled "Custom Color" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WaterColorByObject { get; }
Visual Basic
Public Shared ReadOnly Property WaterColorByObject As String
	Get
Visual C++
public:
static property String^ WaterColorByObject {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Water Class
Autodesk.Revit.DB.Visual Namespace